Tekla Open API Reference for Tekla Structures 2025
StraightDimensionAttributes Properties
The StraightDimension.StraightDimensionAttributes type exposes the following members.
Properties
Name | Description
DimensionValuePostfix
 The postfix for the dimension's value.
DimensionValuePrefix
 The prefix for the dimension's value.
Exaggeration
 The exaggeration attributes of the dimension.
MiddleLowerTag
 The dimension tag placed under the dimension value.
Top
See Also
Reference
StraightDimension.StraightDimensionAttributes Class
Tekla.Structures.Drawing Namespace